app/controllers/expenses_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["user_id", 34], ["id", 1], ["LIMIT", 1]]
---
  def index
    @group = current_user.groups.find(params[:group_id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @group = Group.find(params[:group_id])