app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 34]]

  def create
    p gro_params
    p current_user.id
    # @group = Group.new(name: params[:group][:name], icon: params[:group][:icon], author: current_user)
    @group = Group.new(gro_params)
    @group.user_id = current_user.id
    if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Group 1"], ["icon", "#"], ["user_id", 34], ["created_at", "2023-02-26 18:59:31.877207"], ["updated_at", "2023-02-26 18:59:31.877207"]]